# -*- coding: utf-8 -*-"
#+STARTUP: overview indent

#+TITLE: Avaliação

#+OPTIONS: html-link-use-abs-url:nil html-postamble:auto
#+OPTIONS: html-preamble:t html-scripts:t html-style:t
#+OPTIONS: html5-fancy:nil tex:t
#+HTML_DOCTYPE: xhtml-strict
#+HTML_CONTAINER: div
#+DESCRIPTION:
#+KEYWORDS:
#+HTML_LINK_HOME:
#+HTML_LINK_UP:
#+HTML_MATHJAX:
#+HTML_HEAD:
#+HTML_HEAD_EXTRA:
#+SUBTITLE:
#+INFOJS_OPT:
#+CREATOR: <a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.2 (<a href="http://orgmode.org">Org</a> mode 9.0.1)
#+LATEX_HEADER:
#+EXPORT_EXCLUDE_TAGS: noexport
#+EXPORT_SELECT_TAGS: export
#+TAGS: noexport(n) deprecated(d)

Aguarde.

* Ponderações gerais

Para tomar conhecimento novamente das fórmulas utilizadas:
- [[./plano/index.org][As ponderações gerais]]
- [[./projeto/README.org][As ponderações das etapas do projeto]]

* Conceitos e Notas Finais                                         :noexport:

Em 08/07, pós-recuperação.

| ID     |   P1 |   P2 |   PR |   TF | FINAL | Freq | Conceito |
|--------+------+------+------+------+-------+------+----------|
| ???552 |  9.6 | 8.38 |    0 | 9.61 |   9.3 |   80 | A        |
| ???701 | 8.44 | 8.38 |    0 | 9.83 |  9.12 |   92 | A        |
| ???698 | 7.11 | 9.46 |    0 | 9.83 |  9.06 |   88 | A        |
| ???782 | 8.33 | 5.68 |    0 | 6.99 |     7 |   96 | C        |
| ???103 | 0.83 | 5.41 | 4.55 | 7.71 |  6.13 |   80 | C        |

* Detalhamento Geral                                               :noexport:

Situação em 08/07, pós-recuperação.

| ID     | E1.O | E1.S | E2.O | E2.S | E3.O | E3.S | E4.O | E4.S | E5.O | E5.S | E6.O | E6.S | Faltas | Freq |   P1 |   P2 |   PR |   TF |
|--------+------+------+------+------+------+------+------+------+------+------+------+------+--------+------+------+------+------+------|
| ???701 |  9.8 |   10 |  9.9 |   10 |   10 |   10 | 9.23 |    9 |   10 |   10 |   10 |   10 |      2 |   92 | 8.44 | 8.38 |    0 | 9.83 |
| ???103 |    9 |  9.5 |  9.9 |    9 |   10 |    0 | 9.04 |    3 | 9.58 |    7 |   10 | 7.16 |      5 |   80 | 0.83 | 5.41 | 4.55 | 7.71 |
| ???552 |   10 |   10 |   10 |   10 |   10 |  9.5 | 8.27 |    9 |   10 |   10 |   10 | 8.53 |      5 |   80 |  9.6 | 8.38 |    0 | 9.61 |
| ???698 |  9.8 |   10 |  9.9 |   10 |   10 |   10 | 9.23 |    9 |   10 |   10 |   10 |   10 |      3 |   88 | 7.11 | 9.46 |    0 | 9.83 |
| ???782 |   10 |   10 |  9.3 |  9.5 |   10 |  9.5 | 9.71 |    4 | 7.92 |    6 |    0 |    0 |      1 |   96 | 8.33 | 5.68 |    0 | 6.99 |

* PR                                                               :noexport:
** Gabarito

PR espera 33 respostas, com o gabarito abaixo.

| Questão | Gabarito  |
|---------+-----------|
| 01.X    | E         |
| 02.X    | C         |
| 03.X    | D         |
| 04.X    | AADDDAAA  |
| 05.M    | 100100    |
| 05.N    | A         |
| 05.O    | B         |
| 06.X    | E         |
| 07.X    | C         |
| 08.X    | A         |
| 09.M    | 7 9 12    |
| 09.N    | 6         |
| 09.O    | 3 10      |
| 09.P    | 1 11      |
| 09.Q    | 2 5 8     |
| 09.R    | 4         |
| 10.A    | F         |
| 10.B    | F         |
| 10.C    | V         |
| 10.D    | F         |
| 10.E    | F         |
| 11.X    | 10110     |
| 12.X    | D         |
| 13.M    | C         |
| 13.N    | A         |
| 13.O    | B         |
| 14.X    | C         |
| 15.X    | A         |
| 16.X    | D         |
| 17.X    | E         |
| 18.M    | D         |
| 18.N    | 2 1 1 0 0 |
| 18.O    | E         |
** Sumário

| ID     |   PR |
|--------+------|
| ???103 | 4.55 |

** Taxa de acertos por questão

| Questão | Respostas | Corretas | Taxa |
|---------+-----------+----------+------|
| 02.X    |         1 |        1 |  100 |
| 04.X    |         1 |        1 |  100 |
| 05.N    |         1 |        1 |  100 |
| 05.O    |         1 |        1 |  100 |
| 06.X    |         1 |        1 |  100 |
| 07.X    |         1 |        1 |  100 |
| 09.N    |         1 |        1 |  100 |
| 09.O    |         1 |        1 |  100 |
| 09.P    |         1 |        1 |  100 |
| 09.Q    |         1 |        1 |  100 |
| 09.R    |         1 |        1 |  100 |
| 10.D    |         1 |        1 |  100 |
| 10.E    |         1 |        1 |  100 |
| 12.X    |         1 |        1 |  100 |
| 16.X    |         1 |        1 |  100 |
| 01.X    |         1 |        0 |    0 |
| 03.X    |         1 |        0 |    0 |
| 05.M    |         1 |        0 |    0 |
| 08.X    |         1 |        0 |    0 |
| 09.M    |         1 |        0 |    0 |
| 10.A    |         1 |        0 |    0 |
| 10.B    |         1 |        0 |    0 |
| 10.C    |         1 |        0 |    0 |
| 11.X    |         1 |        0 |    0 |
| 13.M    |         1 |        0 |    0 |
| 13.N    |         1 |        0 |    0 |
| 13.O    |         1 |        0 |    0 |
| 14.X    |         1 |        0 |    0 |
| 15.X    |         1 |        0 |    0 |
| 17.X    |         1 |        0 |    0 |
| 18.M    |         1 |        0 |    0 |
| 18.N    |         1 |        0 |    0 |
| 18.O    |         1 |        0 |    0 |

** Detalhamento

| ID     | Questão | Resposta  | Gabarito  | Correta |
|--------+---------+-----------+-----------+---------|
| ???103 | 01.X    | =D=         | =E=         | FALSE   |
| ???103 | 02.X    | =C=         | =C=         | TRUE    |
| ???103 | 03.X    | =A=         | =D=         | FALSE   |
| ???103 | 04.X    | =AADDDAAA=  | =AADDDAAA=  | TRUE    |
| ???103 | 05.M    | =10110=     | =100100=    | FALSE   |
| ???103 | 05.N    | =A=         | =A=         | TRUE    |
| ???103 | 05.O    | =B=         | =B=         | TRUE    |
| ???103 | 06.X    | =E=         | =E=         | TRUE    |
| ???103 | 07.X    | =C=         | =C=         | TRUE    |
| ???103 | 08.X    | =D=         | =A=         | FALSE   |
| ???103 | 09.M    | =12 7 9=    | =7 9 12=    | FALSE   |
| ???103 | 09.N    | =6=         | =6=         | TRUE    |
| ???103 | 09.O    | =10 3=      | =3 10=      | TRUE    |
| ???103 | 09.P    | =1 11=      | =1 11=      | TRUE    |
| ???103 | 09.Q    | =8 5 2=     | =2 5 8=     | TRUE    |
| ???103 | 09.R    | =4=         | =4=         | TRUE    |
| ???103 | 10.A    | =V=         | =F=         | FALSE   |
| ???103 | 10.B    | =V=         | =F=         | FALSE   |
| ???103 | 10.C    | =F=         | =V=         | FALSE   |
| ???103 | 10.D    | =F=         | =F=         | TRUE    |
| ???103 | 10.E    | =F=         | =F=         | TRUE    |
| ???103 | 11.X    | =01011=     | =10110=     | FALSE   |
| ???103 | 12.X    | =D=         | =D=         | TRUE    |
| ???103 | 13.M    | =A=         | =C=         | FALSE   |
| ???103 | 13.N    | =B=         | =A=         | FALSE   |
| ???103 | 13.O    | =C=         | =B=         | FALSE   |
| ???103 | 14.X    | =A=         | =C=         | FALSE   |
| ???103 | 15.X    | =E=         | =A=         | FALSE   |
| ???103 | 16.X    | =D=         | =D=         | TRUE    |
| ???103 | 17.X    | =A=         | =E=         | FALSE   |
| ???103 | 18.M    | =C=         | =D=         | FALSE   |
| ???103 | 18.N    | =2 4 1 0 0= | =2 1 1 0 0= | FALSE   |
| ???103 | 18.O    | =C=         | =E=         | FALSE   |

* P2                                                               :noexport:
** Gabarito

P2 espera 37 respostas, com o gabarito abaixo.
- A ordem das numerações nas respostas =05.O=, =05.P=, e =05.Q= não tem importância

| Questão | Gabarito                           |
|---------+------------------------------------|
| 01.X    | D                                  |
| 02.X    | C                                  |
| 03.A    | F                                  |
| 03.B    | V                                  |
| 03.C    | F                                  |
| 03.D    | V                                  |
| 03.E    | F                                  |
| 04.X    | A                                  |
| 05.M    | 10 4 1                             |
| 05.N    | 8                                  |
| 05.O    | 7 9                                |
| 05.P    | 2 11                               |
| 05.Q    | 5 6 12                             |
| 05.R    | 3                                  |
| 05.S    | -28                                |
| 05.T    | 72                                 |
| 06.X    | A                                  |
| 07.X    | E                                  |
| 08.M    | B                                  |
| 08.N    | D                                  |
| 08.O    | C                                  |
| 09.M    | A                                  |
| 09.N    | E                                  |
| 10.M    | 2 4 12 1 6 9 5 11 5 3 5 7 5 10 5 8 |
| 10.N    | 13 1 2 4 12 6 3 5 7 5 11 5 8       |
| 11.A    | F                                  |
| 11.B    | V                                  |
| 11.C    | F                                  |
| 11.D    | V                                  |
| 11.E    | F                                  |
| 12.M    | E                                  |
| 12.N    | C                                  |
| 13.X    | B                                  |
| 14.X    | C                                  |
| 15.M    | A                                  |
| 15.N    | 2 1 1 0 0                          |
| 15.O    | D                                  |

** Sumário

Estatísticas

#+BEGIN_EXAMPLE
:    Min. 1st Qu.  Median    Mean 3rd Qu.    Max. 
:   5.410   5.680   8.380   7.462   8.380   9.460
#+END_EXAMPLE

Por aluno

#+name: p2.notas
| ID     |   P2 |
|--------+------|
| ???698 | 9.46 |
| ???552 | 8.38 |
| ???701 | 8.38 |
| ???782 | 5.68 |
| ???103 | 5.41 |

** Taxa de acertos por questão

| Questão | Respostas | Corretas | Taxa |
|---------+-----------+----------+------|
| 01.X    |         5 |        5 |  100 |
| 03.B    |         5 |        5 |  100 |
| 03.C    |         5 |        5 |  100 |
| 03.D    |         5 |        5 |  100 |
| 04.X    |         5 |        5 |  100 |
| 05.N    |         5 |        5 |  100 |
| 05.O    |         5 |        5 |  100 |
| 05.P    |         5 |        5 |  100 |
| 05.Q    |         5 |        5 |  100 |
| 05.R    |         5 |        5 |  100 |
| 09.M    |         5 |        5 |  100 |
| 09.N    |         5 |        5 |  100 |
| 11.A    |         5 |        5 |  100 |
| 11.C    |         5 |        5 |  100 |
| 12.M    |         5 |        5 |  100 |
| 03.A    |         5 |        4 |   80 |
| 03.E    |         5 |        4 |   80 |
| 05.M    |         5 |        4 |   80 |
| 06.X    |         5 |        4 |   80 |
| 07.X    |         5 |        4 |   80 |
| 08.O    |         5 |        4 |   80 |
| 11.D    |         5 |        4 |   80 |
| 11.E    |         5 |        4 |   80 |
| 02.X    |         5 |        3 |   60 |
| 11.B    |         5 |        3 |   60 |
| 12.N    |         5 |        3 |   60 |
| 13.X    |         5 |        3 |   60 |
| 14.X    |         5 |        3 |   60 |
| 15.N    |         4 |        2 |   50 |
| 05.S    |         5 |        2 |   40 |
| 05.T    |         5 |        2 |   40 |
| 08.M    |         5 |        2 |   40 |
| 08.N    |         5 |        2 |   40 |
| 10.M    |         5 |        2 |   40 |
| 15.M    |         5 |        2 |   40 |
| 10.N    |         5 |        1 |   20 |
| 15.O    |         5 |        1 |   20 |

** Detalhamento

São listadas todas as ~184~ respostas com valores:
- Foram portanto omitidas as questões não respondidas.

| ID     | Questão | Resposta                              | Gabarito                           | Correta |
|--------+---------+---------------------------------------+------------------------------------+---------|
| ???103 | 01.X    | D                                     | D                                  | TRUE    |
| ???103 | 02.X    | D                                     | C                                  | FALSE   |
| ???103 | 03.A    | V                                     | F                                  | FALSE   |
| ???103 | 03.B    | V                                     | V                                  | TRUE    |
| ???103 | 03.C    | F                                     | F                                  | TRUE    |
| ???103 | 03.D    | V                                     | V                                  | TRUE    |
| ???103 | 03.E    | V                                     | F                                  | FALSE   |
| ???103 | 04.X    | A                                     | A                                  | TRUE    |
| ???103 | 05.M    | 1 10 4                                | 10 4 1                             | FALSE   |
| ???103 | 05.N    | 8                                     | 8                                  | TRUE    |
| ???103 | 05.O    | 9 7                                   | 7 9                                | TRUE    |
| ???103 | 05.P    | 11 2                                  | 2 11                               | TRUE    |
| ???103 | 05.Q    | 6 12 5                                | 5 6 12                             | TRUE    |
| ???103 | 05.R    | 3                                     | 3                                  | TRUE    |
| ???103 | 05.S    | 28                                    | -28                                | FALSE   |
| ???103 | 05.T    | 64                                    | 72                                 | FALSE   |
| ???103 | 06.X    | A                                     | A                                  | TRUE    |
| ???103 | 07.X    | E                                     | E                                  | TRUE    |
| ???103 | 08.M    | E                                     | B                                  | FALSE   |
| ???103 | 08.N    | C                                     | D                                  | FALSE   |
| ???103 | 08.O    | C                                     | C                                  | TRUE    |
| ???103 | 09.M    | A                                     | A                                  | TRUE    |
| ???103 | 09.N    | E                                     | E                                  | TRUE    |
| ???103 | 10.M    | 4 12 1 6 9 11 5 3 5 7 5 10 5 8        | 2 4 12 1 6 9 5 11 5 3 5 7 5 10 5 8 | FALSE   |
| ???103 | 10.N    | 1 6 5 7 5 16                          | 13 1 2 4 12 6 3 5 7 5 11 5 8       | FALSE   |
| ???103 | 11.A    | F                                     | F                                  | TRUE    |
| ???103 | 11.B    | V                                     | V                                  | TRUE    |
| ???103 | 11.C    | F                                     | F                                  | TRUE    |
| ???103 | 11.D    | V                                     | V                                  | TRUE    |
| ???103 | 11.E    | V                                     | F                                  | FALSE   |
| ???103 | 12.M    | E                                     | E                                  | TRUE    |
| ???103 | 12.N    | D                                     | C                                  | FALSE   |
| ???103 | 13.X    | D                                     | B                                  | FALSE   |
| ???103 | 14.X    | B                                     | C                                  | FALSE   |
| ???103 | 15.M    | C                                     | A                                  | FALSE   |
| ???103 | 15.N    | 2 2 1 0 0                             | 2 1 1 0 0                          | FALSE   |
| ???103 | 15.O    | C                                     | D                                  | FALSE   |
| ???552 | 01.X    | D                                     | D                                  | TRUE    |
| ???552 | 02.X    | C                                     | C                                  | TRUE    |
| ???552 | 03.A    | F                                     | F                                  | TRUE    |
| ???552 | 03.B    | V                                     | V                                  | TRUE    |
| ???552 | 03.C    | F                                     | F                                  | TRUE    |
| ???552 | 03.D    | V                                     | V                                  | TRUE    |
| ???552 | 03.E    | F                                     | F                                  | TRUE    |
| ???552 | 04.X    | A                                     | A                                  | TRUE    |
| ???552 | 05.M    | 10 4 1                                | 10 4 1                             | TRUE    |
| ???552 | 05.N    | 8                                     | 8                                  | TRUE    |
| ???552 | 05.O    | 7 9                                   | 7 9                                | TRUE    |
| ???552 | 05.P    | 2 11                                  | 2 11                               | TRUE    |
| ???552 | 05.Q    | 5 6 12                                | 5 6 12                             | TRUE    |
| ???552 | 05.R    | 3                                     | 3                                  | TRUE    |
| ???552 | 05.S    | -28                                   | -28                                | TRUE    |
| ???552 | 05.T    | 72                                    | 72                                 | TRUE    |
| ???552 | 06.X    | A                                     | A                                  | TRUE    |
| ???552 | 07.X    | E                                     | E                                  | TRUE    |
| ???552 | 08.M    | B                                     | B                                  | TRUE    |
| ???552 | 08.N    | D                                     | D                                  | TRUE    |
| ???552 | 08.O    | C                                     | C                                  | TRUE    |
| ???552 | 09.M    | A                                     | A                                  | TRUE    |
| ???552 | 09.N    | E                                     | E                                  | TRUE    |
| ???552 | 10.M    | 2 4 12 13 1 6 9 5 11 5 3 5 7 5 10 5 8 | 2 4 12 1 6 9 5 11 5 3 5 7 5 10 5 8 | FALSE   |
| ???552 | 10.N    | 13 1 2 4 12 6 3  5 7 5 11 5 8         | 13 1 2 4 12 6 3 5 7 5 11 5 8       | FALSE   |
| ???552 | 11.A    | F                                     | F                                  | TRUE    |
| ???552 | 11.B    | F                                     | V                                  | FALSE   |
| ???552 | 11.C    | F                                     | F                                  | TRUE    |
| ???552 | 11.D    | V                                     | V                                  | TRUE    |
| ???552 | 11.E    | F                                     | F                                  | TRUE    |
| ???552 | 12.M    | E                                     | E                                  | TRUE    |
| ???552 | 12.N    | C                                     | C                                  | TRUE    |
| ???552 | 13.X    | B                                     | B                                  | TRUE    |
| ???552 | 14.X    | C                                     | C                                  | TRUE    |
| ???552 | 15.M    | B                                     | A                                  | FALSE   |
| ???552 | 15.N    | 1 1 1 0 0                             | 2 1 1 0 0                          | FALSE   |
| ???552 | 15.O    | C                                     | D                                  | FALSE   |
| ???698 | 01.X    | D                                     | D                                  | TRUE    |
| ???698 | 02.X    | C                                     | C                                  | TRUE    |
| ???698 | 03.A    | F                                     | F                                  | TRUE    |
| ???698 | 03.B    | V                                     | V                                  | TRUE    |
| ???698 | 03.C    | F                                     | F                                  | TRUE    |
| ???698 | 03.D    | V                                     | V                                  | TRUE    |
| ???698 | 03.E    | F                                     | F                                  | TRUE    |
| ???698 | 04.X    | A                                     | A                                  | TRUE    |
| ???698 | 05.M    | 10 4 1                                | 10 4 1                             | TRUE    |
| ???698 | 05.N    | 8                                     | 8                                  | TRUE    |
| ???698 | 05.O    | 7 9                                   | 7 9                                | TRUE    |
| ???698 | 05.P    | 11 2                                  | 2 11                               | TRUE    |
| ???698 | 05.Q    | 5 6 12                                | 5 6 12                             | TRUE    |
| ???698 | 05.R    | 3                                     | 3                                  | TRUE    |
| ???698 | 05.S    | -7                                    | -28                                | FALSE   |
| ???698 | 05.T    | 72                                    | 72                                 | TRUE    |
| ???698 | 06.X    | A                                     | A                                  | TRUE    |
| ???698 | 07.X    | E                                     | E                                  | TRUE    |
| ???698 | 08.M    | C                                     | B                                  | FALSE   |
| ???698 | 08.N    | D                                     | D                                  | TRUE    |
| ???698 | 08.O    | C                                     | C                                  | TRUE    |
| ???698 | 09.M    | A                                     | A                                  | TRUE    |
| ???698 | 09.N    | E                                     | E                                  | TRUE    |
| ???698 | 10.M    | 2 4 12 1 6 9 5 11 5 3 5 7 5 10 5 8    | 2 4 12 1 6 9 5 11 5 3 5 7 5 10 5 8 | TRUE    |
| ???698 | 10.N    | 13 1 2 4 12 6 3 5 7 5 11 5 8          | 13 1 2 4 12 6 3 5 7 5 11 5 8       | TRUE    |
| ???698 | 11.A    | F                                     | F                                  | TRUE    |
| ???698 | 11.B    | V                                     | V                                  | TRUE    |
| ???698 | 11.C    | F                                     | F                                  | TRUE    |
| ???698 | 11.D    | V                                     | V                                  | TRUE    |
| ???698 | 11.E    | F                                     | F                                  | TRUE    |
| ???698 | 12.M    | E                                     | E                                  | TRUE    |
| ???698 | 12.N    | C                                     | C                                  | TRUE    |
| ???698 | 13.X    | B                                     | B                                  | TRUE    |
| ???698 | 14.X    | C                                     | C                                  | TRUE    |
| ???698 | 15.M    | A                                     | A                                  | TRUE    |
| ???698 | 15.N    | 2 1 1 0 0                             | 2 1 1 0 0                          | TRUE    |
| ???698 | 15.O    | D                                     | D                                  | TRUE    |
| ???701 | 01.X    | D                                     | D                                  | TRUE    |
| ???701 | 02.X    | E                                     | C                                  | FALSE   |
| ???701 | 03.A    | F                                     | F                                  | TRUE    |
| ???701 | 03.B    | V                                     | V                                  | TRUE    |
| ???701 | 03.C    | F                                     | F                                  | TRUE    |
| ???701 | 03.D    | V                                     | V                                  | TRUE    |
| ???701 | 03.E    | F                                     | F                                  | TRUE    |
| ???701 | 04.X    | A                                     | A                                  | TRUE    |
| ???701 | 05.M    | 10 4 1                                | 10 4 1                             | TRUE    |
| ???701 | 05.N    | 8                                     | 8                                  | TRUE    |
| ???701 | 05.O    | 9 7                                   | 7 9                                | TRUE    |
| ???701 | 05.P    | 2 11                                  | 2 11                               | TRUE    |
| ???701 | 05.Q    | 6 12 5                                | 5 6 12                             | TRUE    |
| ???701 | 05.R    | 3                                     | 3                                  | TRUE    |
| ???701 | 05.S    | -28                                   | -28                                | TRUE    |
| ???701 | 05.T    | 44                                    | 72                                 | FALSE   |
| ???701 | 06.X    | A                                     | A                                  | TRUE    |
| ???701 | 07.X    | E                                     | E                                  | TRUE    |
| ???701 | 08.M    | B                                     | B                                  | TRUE    |
| ???701 | 08.N    | A                                     | D                                  | FALSE   |
| ???701 | 08.O    | C                                     | C                                  | TRUE    |
| ???701 | 09.M    | A                                     | A                                  | TRUE    |
| ???701 | 09.N    | E                                     | E                                  | TRUE    |
| ???701 | 10.M    | 2 4 12 1 6 9 5 11 5 3 5 7 5 10 5 8    | 2 4 12 1 6 9 5 11 5 3 5 7 5 10 5 8 | TRUE    |
| ???701 | 10.N    | 13 1 2 12 6 15 5 7 5 11 5 8           | 13 1 2 4 12 6 3 5 7 5 11 5 8       | FALSE   |
| ???701 | 11.A    | F                                     | F                                  | TRUE    |
| ???701 | 11.B    | F                                     | V                                  | FALSE   |
| ???701 | 11.C    | F                                     | F                                  | TRUE    |
| ???701 | 11.D    | V                                     | V                                  | TRUE    |
| ???701 | 11.E    | F                                     | F                                  | TRUE    |
| ???701 | 12.M    | E                                     | E                                  | TRUE    |
| ???701 | 12.N    | C                                     | C                                  | TRUE    |
| ???701 | 13.X    | B                                     | B                                  | TRUE    |
| ???701 | 14.X    | C                                     | C                                  | TRUE    |
| ???701 | 15.M    | A                                     | A                                  | TRUE    |
| ???701 | 15.N    | 2 1 1 0 0                             | 2 1 1 0 0                          | TRUE    |
| ???701 | 15.O    | C                                     | D                                  | FALSE   |
| ???782 | 01.X    | D                                     | D                                  | TRUE    |
| ???782 | 02.X    | C                                     | C                                  | TRUE    |
| ???782 | 03.A    | F                                     | F                                  | TRUE    |
| ???782 | 03.B    | V                                     | V                                  | TRUE    |
| ???782 | 03.C    | F                                     | F                                  | TRUE    |
| ???782 | 03.D    | V                                     | V                                  | TRUE    |
| ???782 | 03.E    | F                                     | F                                  | TRUE    |
| ???782 | 04.X    | A                                     | A                                  | TRUE    |
| ???782 | 05.M    | 10 4 1                                | 10 4 1                             | TRUE    |
| ???782 | 05.N    | 8                                     | 8                                  | TRUE    |
| ???782 | 05.O    | 9 7                                   | 7 9                                | TRUE    |
| ???782 | 05.P    | 11 2                                  | 2 11                               | TRUE    |
| ???782 | 05.Q    | 6 12 5                                | 5 6 12                             | TRUE    |
| ???782 | 05.R    | 3                                     | 3                                  | TRUE    |
| ???782 | 05.S    | 7                                     | -28                                | FALSE   |
| ???782 | 05.T    | 32                                    | 72                                 | FALSE   |
| ???782 | 06.X    | E                                     | A                                  | FALSE   |
| ???782 | 07.X    | C                                     | E                                  | FALSE   |
| ???782 | 08.M    | D                                     | B                                  | FALSE   |
| ???782 | 08.N    | B                                     | D                                  | FALSE   |
| ???782 | 08.O    | E                                     | C                                  | FALSE   |
| ???782 | 09.M    | A                                     | A                                  | TRUE    |
| ???782 | 09.N    | E                                     | E                                  | TRUE    |
| ???782 | 10.M    | 2 4 12 1 6 11 5 3 5 7 5 8 10 9        | 2 4 12 1 6 9 5 11 5 3 5 7 5 10 5 8 | FALSE   |
| ???782 | 10.N    | 13 6 9 5 7                            | 13 1 2 4 12 6 3 5 7 5 11 5 8       | FALSE   |
| ???782 | 11.A    | F                                     | F                                  | TRUE    |
| ???782 | 11.B    | V                                     | V                                  | TRUE    |
| ???782 | 11.C    | F                                     | F                                  | TRUE    |
| ???782 | 11.D    | F                                     | V                                  | FALSE   |
| ???782 | 11.E    | F                                     | F                                  | TRUE    |
| ???782 | 12.M    | E                                     | E                                  | TRUE    |
| ???782 | 12.N    | E                                     | C                                  | FALSE   |
| ???782 | 13.X    | D                                     | B                                  | FALSE   |
| ???782 | 14.X    | B                                     | C                                  | FALSE   |
| ???782 | 15.M    | B                                     | A                                  | FALSE   |
| ???782 | 15.O    | C                                     | D                                  | FALSE   |

* P1
** Gabarito

|   E | Gabarito                                      |
|-----+-----------------------------------------------|
| 2.1 | V                                             |
| 2.2 | V                                             |
| 2.3 | F                                             |
| 2.4 | F                                             |
| 3.1 | A                                             |
| 3.2 | D                                             |
| 3.3 | D                                             |
| 3.4 | A                                             |
| 3.5 | D                                             |
| 3.6 | D                                             |
| 3.7 | A                                             |
| 3.8 | A                                             |
|   6 | 9 28 28 24 10 1 2 28 28 24 3 28 28 25 12 4 11 |

** Pesos

| Q    | Peso |
|------+------|
| E1.1 |  0.5 |
| E1.2 | 0.75 |
| E1.3 | 0.75 |
| E2   |  1.0 |
| E3   |  1.0 |
| E4.1 |  0.2 |
| E4.2 |  0.3 |
| E4.3 |  1.0 |
| E4.4 |  0.5 |
| E5.1 |  0.2 |
| E5.2 |  1.0 |
| E5.3 |  0.8 |
| E5.4 |  0.5 |
| E6   |  1.5 |

** Detalhamento
*** E2, E3, E6

#+header: :var dep0=p1_2019-2
#+begin_src R :results table :session :exports both :colnames yes
t %>%
    select(-Nome) %>%
    select(ID, E, Resposta, Gabarito, Similaridade, Nota) %>%
    mutate(ID = gsub("^...", "???", ID))
#+end_src

#+RESULTS:
| ID     | E    | Resposta                                                 | Gabarito                                      | Similaridade | Nota |
|--------+------+----------------------------------------------------------+-----------------------------------------------+--------------+------|
| ???253 | E2.1 | V                                                        | V                                             |            1 |   10 |
| ???162 | E2.1 | V                                                        | V                                             |            1 |   10 |
| ???545 | E2.1 | V                                                        | V                                             |            1 |   10 |
| ???759 | E2.1 | V                                                        | V                                             |            1 |   10 |
| ???887 | E2.1 | V                                                        | V                                             |            1 |   10 |
| ???638 | E2.1 | V                                                        | V                                             |            1 |   10 |
| ???726 | E2.1 | V                                                        | V                                             |            1 |   10 |
| ???732 | E2.1 | V                                                        | V                                             |            1 |   10 |
| ???712 | E2.1 | V                                                        | V                                             |            1 |   10 |
| ???451 | E2.1 | V                                                        | V                                             |            1 |   10 |
| ???692 | E2.1 | V                                                        | V                                             |            1 |   10 |
| ???087 | E2.1 | V                                                        | V                                             |            1 |   10 |
| ???172 | E2.1 | V                                                        | V                                             |            1 |   10 |
| ???652 | E2.1 | F                                                        | V                                             |            0 |    0 |
| ???909 | E2.1 | V                                                        | V                                             |            1 |   10 |
| ???991 | E2.1 | V                                                        | V                                             |            1 |   10 |
| ???108 | E2.1 | V                                                        | V                                             |            1 |   10 |
| ???165 | E2.1 | F                                                        | V                                             |            0 |    0 |
| ???502 | E2.1 | V                                                        | V                                             |            1 |   10 |
| ???490 | E2.1 | V                                                        | V                                             |            1 |   10 |
| ???110 | E2.1 | V                                                        | V                                             |            1 |   10 |
| ???253 | E2.2 | V                                                        | V                                             |            1 |   10 |
| ???162 | E2.2 | F                                                        | V                                             |            0 |    0 |
| ???545 | E2.2 | V                                                        | V                                             |            1 |   10 |
| ???759 | E2.2 | V                                                        | V                                             |            1 |   10 |
| ???887 | E2.2 | V                                                        | V                                             |            1 |   10 |
| ???638 | E2.2 | V                                                        | V                                             |            1 |   10 |
| ???726 | E2.2 | V                                                        | V                                             |            1 |   10 |
| ???732 | E2.2 | V                                                        | V                                             |            1 |   10 |
| ???712 | E2.2 | V                                                        | V                                             |            1 |   10 |
| ???451 | E2.2 | V                                                        | V                                             |            1 |   10 |
| ???692 | E2.2 | V                                                        | V                                             |            1 |   10 |
| ???087 | E2.2 | V                                                        | V                                             |            1 |   10 |
| ???172 | E2.2 | V                                                        | V                                             |            1 |   10 |
| ???652 | E2.2 | V                                                        | V                                             |            1 |   10 |
| ???909 | E2.2 | F                                                        | V                                             |            0 |    0 |
| ???991 | E2.2 | V                                                        | V                                             |            1 |   10 |
| ???108 | E2.2 | V                                                        | V                                             |            1 |   10 |
| ???165 | E2.2 | V                                                        | V                                             |            1 |   10 |
| ???502 | E2.2 | V                                                        | V                                             |            1 |   10 |
| ???490 | E2.2 | V                                                        | V                                             |            1 |   10 |
| ???110 | E2.2 | V                                                        | V                                             |            1 |   10 |
| ???253 | E2.3 | F                                                        | F                                             |            1 |   10 |
| ???162 | E2.3 | F                                                        | F                                             |            1 |   10 |
| ???545 | E2.3 | F                                                        | F                                             |            1 |   10 |
| ???759 | E2.3 | V                                                        | F                                             |            0 |    0 |
| ???887 | E2.3 | V                                                        | F                                             |            0 |    0 |
| ???638 | E2.3 | V                                                        | F                                             |            0 |    0 |
| ???726 | E2.3 | F                                                        | F                                             |            1 |   10 |
| ???732 | E2.3 | F                                                        | F                                             |            1 |   10 |
| ???712 | E2.3 | F                                                        | F                                             |            1 |   10 |
| ???451 | E2.3 | F                                                        | F                                             |            1 |   10 |
| ???692 | E2.3 | F                                                        | F                                             |            1 |   10 |
| ???087 | E2.3 | F                                                        | F                                             |            1 |   10 |
| ???172 | E2.3 | V                                                        | F                                             |            0 |    0 |
| ???652 | E2.3 | F                                                        | F                                             |            1 |   10 |
| ???909 | E2.3 | F                                                        | F                                             |            1 |   10 |
| ???991 | E2.3 | F                                                        | F                                             |            1 |   10 |
| ???108 | E2.3 | F                                                        | F                                             |            1 |   10 |
| ???165 | E2.3 | F                                                        | F                                             |            1 |   10 |
| ???502 | E2.3 | F                                                        | F                                             |            1 |   10 |
| ???490 | E2.3 | F                                                        | F                                             |            1 |   10 |
| ???110 | E2.3 | F                                                        | F                                             |            1 |   10 |
| ???253 | E2.4 | F                                                        | F                                             |            1 |   10 |
| ???162 | E2.4 | V                                                        | F                                             |            0 |    0 |
| ???545 | E2.4 | F                                                        | F                                             |            1 |   10 |
| ???759 | E2.4 | F                                                        | F                                             |            1 |   10 |
| ???887 | E2.4 | F                                                        | F                                             |            1 |   10 |
| ???638 | E2.4 | F                                                        | F                                             |            1 |   10 |
| ???726 | E2.4 | F                                                        | F                                             |            1 |   10 |
| ???732 | E2.4 | F                                                        | F                                             |            1 |   10 |
| ???712 | E2.4 | F                                                        | F                                             |            1 |   10 |
| ???451 | E2.4 | F                                                        | F                                             |            1 |   10 |
| ???692 | E2.4 | F                                                        | F                                             |            1 |   10 |
| ???087 | E2.4 | F                                                        | F                                             |            1 |   10 |
| ???172 | E2.4 | F                                                        | F                                             |            1 |   10 |
| ???652 | E2.4 | V                                                        | F                                             |            0 |    0 |
| ???909 | E2.4 | V                                                        | F                                             |            0 |    0 |
| ???991 | E2.4 | F                                                        | F                                             |            1 |   10 |
| ???108 | E2.4 | F                                                        | F                                             |            1 |   10 |
| ???165 | E2.4 | F                                                        | F                                             |            1 |   10 |
| ???502 | E2.4 | F                                                        | F                                             |            1 |   10 |
| ???490 | E2.4 | F                                                        | F                                             |            1 |   10 |
| ???110 | E2.4 | V                                                        | F                                             |            0 |    0 |
| ???253 | E3.1 | D                                                        | A                                             |            0 |    0 |
| ???162 | E3.1 | D                                                        | A                                             |            0 |    0 |
| ???545 | E3.1 | A                                                        | A                                             |            1 |   10 |
| ???759 | E3.1 | A                                                        | A                                             |            1 |   10 |
| ???887 | E3.1 | A                                                        | A                                             |            1 |   10 |
| ???638 | E3.1 | A                                                        | A                                             |            1 |   10 |
| ???726 | E3.1 | A                                                        | A                                             |            1 |   10 |
| ???732 | E3.1 | A                                                        | A                                             |            1 |   10 |
| ???712 | E3.1 | A                                                        | A                                             |            1 |   10 |
| ???451 | E3.1 | A                                                        | A                                             |            1 |   10 |
| ???692 | E3.1 | A                                                        | A                                             |            1 |   10 |
| ???087 | E3.1 | A                                                        | A                                             |            1 |   10 |
| ???172 | E3.1 | A                                                        | A                                             |            1 |   10 |
| ???652 | E3.1 | A                                                        | A                                             |            1 |   10 |
| ???909 | E3.1 | A                                                        | A                                             |            1 |   10 |
| ???991 | E3.1 | A                                                        | A                                             |            1 |   10 |
| ???108 | E3.1 | A                                                        | A                                             |            1 |   10 |
| ???165 | E3.1 | A                                                        | A                                             |            1 |   10 |
| ???502 | E3.1 | A                                                        | A                                             |            1 |   10 |
| ???490 | E3.1 | A                                                        | A                                             |            1 |   10 |
| ???110 | E3.1 | A                                                        | A                                             |            1 |   10 |
| ???253 | E3.2 | D                                                        | D                                             |            1 |   10 |
| ???162 | E3.2 | D                                                        | D                                             |            1 |   10 |
| ???545 | E3.2 | D                                                        | D                                             |            1 |   10 |
| ???759 | E3.2 | D                                                        | D                                             |            1 |   10 |
| ???887 | E3.2 | D                                                        | D                                             |            1 |   10 |
| ???638 | E3.2 | D                                                        | D                                             |            1 |   10 |
| ???726 | E3.2 | D                                                        | D                                             |            1 |   10 |
| ???732 | E3.2 | D                                                        | D                                             |            1 |   10 |
| ???712 | E3.2 | D                                                        | D                                             |            1 |   10 |
| ???451 | E3.2 | D                                                        | D                                             |            1 |   10 |
| ???692 | E3.2 | D                                                        | D                                             |            1 |   10 |
| ???087 | E3.2 | D                                                        | D                                             |            1 |   10 |
| ???172 | E3.2 | D                                                        | D                                             |            1 |   10 |
| ???652 | E3.2 | D                                                        | D                                             |            1 |   10 |
| ???909 | E3.2 | D                                                        | D                                             |            1 |   10 |
| ???991 | E3.2 | D                                                        | D                                             |            1 |   10 |
| ???108 | E3.2 | D                                                        | D                                             |            1 |   10 |
| ???165 | E3.2 | D                                                        | D                                             |            1 |   10 |
| ???502 | E3.2 | D                                                        | D                                             |            1 |   10 |
| ???490 | E3.2 | D                                                        | D                                             |            1 |   10 |
| ???110 | E3.2 | D                                                        | D                                             |            1 |   10 |
| ???253 | E3.3 | D                                                        | D                                             |            1 |   10 |
| ???162 | E3.3 | D                                                        | D                                             |            1 |   10 |
| ???545 | E3.3 | D                                                        | D                                             |            1 |   10 |
| ???759 | E3.3 | D                                                        | D                                             |            1 |   10 |
| ???887 | E3.3 | D                                                        | D                                             |            1 |   10 |
| ???638 | E3.3 | D                                                        | D                                             |            1 |   10 |
| ???726 | E3.3 | D                                                        | D                                             |            1 |   10 |
| ???732 | E3.3 | D                                                        | D                                             |            1 |   10 |
| ???712 | E3.3 | D                                                        | D                                             |            1 |   10 |
| ???451 | E3.3 | A                                                        | D                                             |            0 |    0 |
| ???692 | E3.3 | D                                                        | D                                             |            1 |   10 |
| ???087 | E3.3 | D                                                        | D                                             |            1 |   10 |
| ???172 | E3.3 | D                                                        | D                                             |            1 |   10 |
| ???652 | E3.3 | D                                                        | D                                             |            1 |   10 |
| ???909 | E3.3 | A                                                        | D                                             |            0 |    0 |
| ???991 | E3.3 | D                                                        | D                                             |            1 |   10 |
| ???108 | E3.3 | D                                                        | D                                             |            1 |   10 |
| ???165 | E3.3 | D                                                        | D                                             |            1 |   10 |
| ???502 | E3.3 | D                                                        | D                                             |            1 |   10 |
| ???490 | E3.3 | D                                                        | D                                             |            1 |   10 |
| ???110 | E3.3 | D                                                        | D                                             |            1 |   10 |
| ???253 | E3.4 | D                                                        | A                                             |            0 |    0 |
| ???162 | E3.4 | A                                                        | A                                             |            1 |   10 |
| ???545 | E3.4 | A                                                        | A                                             |            1 |   10 |
| ???759 | E3.4 | A                                                        | A                                             |            1 |   10 |
| ???887 | E3.4 | A                                                        | A                                             |            1 |   10 |
| ???638 | E3.4 | A                                                        | A                                             |            1 |   10 |
| ???726 | E3.4 | A                                                        | A                                             |            1 |   10 |
| ???732 | E3.4 | A                                                        | A                                             |            1 |   10 |
| ???712 | E3.4 | A                                                        | A                                             |            1 |   10 |
| ???451 | E3.4 | A                                                        | A                                             |            1 |   10 |
| ???692 | E3.4 | A                                                        | A                                             |            1 |   10 |
| ???087 | E3.4 | A                                                        | A                                             |            1 |   10 |
| ???172 | E3.4 | A                                                        | A                                             |            1 |   10 |
| ???652 | E3.4 | A                                                        | A                                             |            1 |   10 |
| ???909 | E3.4 | A                                                        | A                                             |            1 |   10 |
| ???991 | E3.4 | A                                                        | A                                             |            1 |   10 |
| ???108 | E3.4 | A                                                        | A                                             |            1 |   10 |
| ???165 | E3.4 | A                                                        | A                                             |            1 |   10 |
| ???502 | E3.4 | A                                                        | A                                             |            1 |   10 |
| ???490 | E3.4 | A                                                        | A                                             |            1 |   10 |
| ???110 | E3.4 | A                                                        | A                                             |            1 |   10 |
| ???253 | E3.5 | A                                                        | D                                             |            0 |    0 |
| ???162 | E3.5 | D                                                        | D                                             |            1 |   10 |
| ???545 | E3.5 | D                                                        | D                                             |            1 |   10 |
| ???759 | E3.5 | D                                                        | D                                             |            1 |   10 |
| ???887 | E3.5 | A                                                        | D                                             |            0 |    0 |
| ???638 | E3.5 | D                                                        | D                                             |            1 |   10 |
| ???726 | E3.5 | D                                                        | D                                             |            1 |   10 |
| ???732 | E3.5 | D                                                        | D                                             |            1 |   10 |
| ???712 | E3.5 | D                                                        | D                                             |            1 |   10 |
| ???451 | E3.5 | D                                                        | D                                             |            1 |   10 |
| ???692 | E3.5 | D                                                        | D                                             |            1 |   10 |
| ???087 | E3.5 | D                                                        | D                                             |            1 |   10 |
| ???172 | E3.5 | A                                                        | D                                             |            0 |    0 |
| ???652 | E3.5 | D                                                        | D                                             |            1 |   10 |
| ???909 | E3.5 | D                                                        | D                                             |            1 |   10 |
| ???991 | E3.5 | D                                                        | D                                             |            1 |   10 |
| ???108 | E3.5 | D                                                        | D                                             |            1 |   10 |
| ???165 | E3.5 | D                                                        | D                                             |            1 |   10 |
| ???502 | E3.5 | D                                                        | D                                             |            1 |   10 |
| ???490 | E3.5 | D                                                        | D                                             |            1 |   10 |
| ???110 | E3.5 | D                                                        | D                                             |            1 |   10 |
| ???253 | E3.6 | D                                                        | D                                             |            1 |   10 |
| ???162 | E3.6 | A                                                        | D                                             |            0 |    0 |
| ???545 | E3.6 | D                                                        | D                                             |            1 |   10 |
| ???759 | E3.6 | D                                                        | D                                             |            1 |   10 |
| ???887 | E3.6 | D                                                        | D                                             |            1 |   10 |
| ???638 | E3.6 | D                                                        | D                                             |            1 |   10 |
| ???726 | E3.6 | D                                                        | D                                             |            1 |   10 |
| ???732 | E3.6 | D                                                        | D                                             |            1 |   10 |
| ???712 | E3.6 | A                                                        | D                                             |            0 |    0 |
| ???451 | E3.6 | D                                                        | D                                             |            1 |   10 |
| ???692 | E3.6 | D                                                        | D                                             |            1 |   10 |
| ???087 | E3.6 | D                                                        | D                                             |            1 |   10 |
| ???172 | E3.6 | D                                                        | D                                             |            1 |   10 |
| ???652 | E3.6 | D                                                        | D                                             |            1 |   10 |
| ???909 | E3.6 | D                                                        | D                                             |            1 |   10 |
| ???991 | E3.6 | D                                                        | D                                             |            1 |   10 |
| ???108 | E3.6 | D                                                        | D                                             |            1 |   10 |
| ???165 | E3.6 | A                                                        | D                                             |            0 |    0 |
| ???502 | E3.6 | D                                                        | D                                             |            1 |   10 |
| ???490 | E3.6 | D                                                        | D                                             |            1 |   10 |
| ???110 | E3.6 | D                                                        | D                                             |            1 |   10 |
| ???253 | E3.7 | A                                                        | A                                             |            1 |   10 |
| ???162 | E3.7 | A                                                        | A                                             |            1 |   10 |
| ???545 | E3.7 | A                                                        | A                                             |            1 |   10 |
| ???759 | E3.7 | A                                                        | A                                             |            1 |   10 |
| ???887 | E3.7 | A                                                        | A                                             |            1 |   10 |
| ???638 | E3.7 | A                                                        | A                                             |            1 |   10 |
| ???726 | E3.7 | A                                                        | A                                             |            1 |   10 |
| ???732 | E3.7 | A                                                        | A                                             |            1 |   10 |
| ???712 | E3.7 | A                                                        | A                                             |            1 |   10 |
| ???451 | E3.7 | A                                                        | A                                             |            1 |   10 |
| ???692 | E3.7 | A                                                        | A                                             |            1 |   10 |
| ???087 | E3.7 | A                                                        | A                                             |            1 |   10 |
| ???172 | E3.7 | A                                                        | A                                             |            1 |   10 |
| ???652 | E3.7 | A                                                        | A                                             |            1 |   10 |
| ???909 | E3.7 | A                                                        | A                                             |            1 |   10 |
| ???991 | E3.7 | A                                                        | A                                             |            1 |   10 |
| ???108 | E3.7 | A                                                        | A                                             |            1 |   10 |
| ???165 | E3.7 | A                                                        | A                                             |            1 |   10 |
| ???502 | E3.7 | A                                                        | A                                             |            1 |   10 |
| ???490 | E3.7 | A                                                        | A                                             |            1 |   10 |
| ???110 | E3.7 | A                                                        | A                                             |            1 |   10 |
| ???253 | E3.8 | D                                                        | A                                             |            0 |    0 |
| ???162 | E3.8 | A                                                        | A                                             |            1 |   10 |
| ???545 | E3.8 | A                                                        | A                                             |            1 |   10 |
| ???759 | E3.8 | A                                                        | A                                             |            1 |   10 |
| ???887 | E3.8 | A                                                        | A                                             |            1 |   10 |
| ???638 | E3.8 | A                                                        | A                                             |            1 |   10 |
| ???726 | E3.8 | A                                                        | A                                             |            1 |   10 |
| ???732 | E3.8 | A                                                        | A                                             |            1 |   10 |
| ???712 | E3.8 | A                                                        | A                                             |            1 |   10 |
| ???451 | E3.8 | A                                                        | A                                             |            1 |   10 |
| ???692 | E3.8 | A                                                        | A                                             |            1 |   10 |
| ???087 | E3.8 | A                                                        | A                                             |            1 |   10 |
| ???172 | E3.8 | A                                                        | A                                             |            1 |   10 |
| ???652 | E3.8 | A                                                        | A                                             |            1 |   10 |
| ???909 | E3.8 | A                                                        | A                                             |            1 |   10 |
| ???991 | E3.8 | A                                                        | A                                             |            1 |   10 |
| ???108 | E3.8 | A                                                        | A                                             |            1 |   10 |
| ???165 | E3.8 | A                                                        | A                                             |            1 |   10 |
| ???502 | E3.8 | A                                                        | A                                             |            1 |   10 |
| ???490 | E3.8 | A                                                        | A                                             |            1 |   10 |
| ???110 | E3.8 | A                                                        | A                                             |            1 |   10 |
| ???253 | E6   | 9 28 28 24 10 1 2 28 28 24 3 28 28 25 12 4 11            | 9 28 28 24 10 1 2 28 28 24 3 28 28 25 12 4 11 |            1 |   10 |
| ???162 | E6   | 9 10 24 28 28 11 1 2 28 28 3 25 28 28 12 4               | 9 28 28 24 10 1 2 28 28 24 3 28 28 25 12 4 11 |         0.85 |    0 |
| ???545 | E6   | 9 28 28 24 10 1 2 28 28 24 3 28 28 25 12 4               | 9 28 28 24 10 1 2 28 28 24 3 28 28 25 12 4 11 |         0.98 |  9.8 |
| ???759 | E6   | 9 28 28 24 10 1 2 28 28 24 3 28 28 25 12 4 11            | 9 28 28 24 10 1 2 28 28 24 3 28 28 25 12 4 11 |            1 |   10 |
| ???887 | E6   | 9 28 28 24 10 1 2 28 28 24 3 28 28 25 12 4 11            | 9 28 28 24 10 1 2 28 28 24 3 28 28 25 12 4 11 |            1 |   10 |
| ???638 | E6   | 9 10 28 28 24 10 1 2 28 28 24 3 28 28 25 12 4 11         | 9 28 28 24 10 1 2 28 28 24 3 28 28 25 12 4 11 |         0.87 |  8.7 |
| ???726 | E6   | 9 28 28 24 10 1 2 28 28 24 3 28 28 25 12 4 11            | 9 28 28 24 10 1 2 28 28 24 3 28 28 25 12 4 11 |            1 |   10 |
| ???732 | E6   | 9 10 11 24 28 28 1 2 3 4 24 28 28 12 25 28 28            | 9 28 28 24 10 1 2 28 28 24 3 28 28 25 12 4 11 |         0.86 |  8.6 |
| ???712 | E6   | 9 28 28 24 10 1 2 28 28 24 3 28 28 25 12 4 11            | 9 28 28 24 10 1 2 28 28 24 3 28 28 25 12 4 11 |            1 |   10 |
| ???451 | E6   | 9 28 28 24 10 1 2 28 28 24 3 28 28 25 12 4               | 9 28 28 24 10 1 2 28 28 24 3 28 28 25 12 4 11 |         0.98 |  9.8 |
| ???692 | E6   | 9 28 28 24 10 1 2 28 28 24 3 28 28 25 12 4 11            | 9 28 28 24 10 1 2 28 28 24 3 28 28 25 12 4 11 |            1 |   10 |
| ???087 | E6   | 1 2 3 4 24 28 28 25 28 28                                | 9 28 28 24 10 1 2 28 28 24 3 28 28 25 12 4 11 |         0.71 |    0 |
| ???172 | E6   | 1 3 24 28 24 28 4 10 24 28 24 28 11 12 25 28 25 28 09 02 | 9 28 28 24 10 1 2 28 28 24 3 28 28 25 12 4 11 |         0.82 |    0 |
| ???652 | E6   | 9 28 28 24 10 1 2 28 28 24 3 28 28 25 12 4 11            | 9 28 28 24 10 1 2 28 28 24 3 28 28 25 12 4 11 |            1 |   10 |
| ???909 | E6   | 9 28 28 24 10 1 2 28 28 24 3 28 28 25 12 4 11            | 9 28 28 24 10 1 2 28 28 24 3 28 28 25 12 4 11 |            1 |   10 |
| ???991 | E6   | 28 28 24 10 28 28 24 3 28 28 25 12 4 2 1 11 9            | 9 28 28 24 10 1 2 28 28 24 3 28 28 25 12 4 11 |         0.85 |    0 |
| ???108 | E6   | 28 28 24 28 28 24                                        | 9 28 28 24 10 1 2 28 28 24 3 28 28 25 12 4 11 |         0.66 |    0 |
| ???165 | E6   | 9 28 28 24 10 1 2 28 28 24 3 28 28 24 12 4 11            | 9 28 28 24 10 1 2 28 28 24 3 28 28 25 12 4 11 |         0.97 |  9.7 |
| ???502 | E6   | 9 28 28 24 10 1 2 28 28 24 3 28 28 25 12 4 11            | 9 28 28 24 10 1 2 28 28 24 3 28 28 25 12 4 11 |            1 |   10 |
| ???490 | E6   | 9 28 28 24 10 1 2 28 28 24 3 28 28 25 12 4 11            | 9 28 28 24 10 1 2 28 28 24 3 28 28 25 12 4 11 |            1 |   10 |
| ???110 | E6   | 9 24 10 1 2 24 3 25 11                                   | 9 28 28 24 10 1 2 28 28 24 3 28 28 25 12 4 11 |         0.69 |    0 |
*** E1, E4, E5

#+header: :var dep0=p1_2019-2
#+begin_src R :results table :session :exports both :colnames yes
t2 %>%
    select(-Nome, -Nota) %>%
    rename(Nota = Resposta) %>%
    select(ID, E, Nota) %>%
    arrange(ID) %>%
    mutate(ID = gsub("^...", "???", ID))
#+end_src

#+RESULTS:
| ID     | E    | Nota |
|--------+------+------|
| ???887 | E1.1 |    5 |
| ???887 | E1.2 |    9 |
| ???887 | E1.3 |   10 |
| ???887 | E4.1 |   10 |
| ???887 | E4.2 |    8 |
| ???887 | E4.3 |   10 |
| ???887 | E4.4 |   10 |
| ???887 | E5.1 |    5 |
| ???887 | E5.2 |   10 |
| ???887 | E5.3 |   10 |
| ???887 | E5.4 |   10 |
| ???087 | E1.1 |   10 |
| ???087 | E1.2 |   10 |
| ???087 | E1.3 |   10 |
| ???087 | E4.1 |   10 |
| ???087 | E4.2 |   10 |
| ???087 | E4.3 |   10 |
| ???087 | E4.4 |   10 |
| ???087 | E5.1 |   10 |
| ???087 | E5.2 |   10 |
| ???087 | E5.3 |   10 |
| ???087 | E5.4 |   10 |
| ???108 | E1.1 |   10 |
| ???108 | E1.2 |   10 |
| ???108 | E1.3 |   10 |
| ???108 | E4.1 |   10 |
| ???108 | E4.2 |    9 |
| ???108 | E4.3 |    8 |
| ???108 | E4.4 |   10 |
| ???108 | E5.1 |    9 |
| ???108 | E5.2 |    2 |
| ???108 | E5.3 |    0 |
| ???108 | E5.4 |    0 |
| ???490 | E1.1 |    9 |
| ???490 | E1.2 |   10 |
| ???490 | E1.3 |   10 |
| ???490 | E4.1 |    0 |
| ???490 | E4.2 |    9 |
| ???490 | E4.3 |    2 |
| ???490 | E4.4 |    0 |
| ???490 | E5.1 |   10 |
| ???490 | E5.2 |    5 |
| ???490 | E5.3 |   10 |
| ???490 | E5.4 |   10 |
| ???991 | E1.1 |    5 |
| ???991 | E1.2 |   10 |
| ???991 | E1.3 |   10 |
| ???991 | E4.1 |   10 |
| ???991 | E4.2 |    9 |
| ???991 | E4.3 |    7 |
| ???991 | E4.4 |    9 |
| ???991 | E5.1 |   10 |
| ???991 | E5.2 |    5 |
| ???991 | E5.3 |   10 |
| ???991 | E5.4 |    7 |
| ???162 | E1.1 |    0 |
| ???162 | E1.2 |    0 |
| ???162 | E1.3 |    0 |
| ???162 | E4.1 |    0 |
| ???162 | E4.2 |    4 |
| ???162 | E4.3 |    0 |
| ???162 | E4.4 |    0 |
| ???162 | E5.1 |    5 |
| ???162 | E5.2 |    1 |
| ???162 | E5.3 |    0 |
| ???162 | E5.4 |    0 |
| ???253 | E1.1 |   10 |
| ???253 | E1.2 |    0 |
| ???253 | E1.3 |    0 |
| ???253 | E4.1 |   10 |
| ???253 | E4.2 |    0 |
| ???253 | E4.3 |    0 |
| ???253 | E4.4 |    0 |
| ???253 | E5.1 |    5 |
| ???253 | E5.2 |    0 |
| ???253 | E5.3 |    0 |
| ???253 | E5.4 |    0 |
| ???451 | E1.1 |    0 |
| ???451 | E1.2 |    5 |
| ???451 | E1.3 |    5 |
| ???451 | E4.1 |   10 |
| ???451 | E4.2 |   10 |
| ???451 | E4.3 |   10 |
| ???451 | E4.4 |   10 |
| ???451 | E5.1 |   10 |
| ???451 | E5.2 |   10 |
| ???451 | E5.3 |   10 |
| ???451 | E5.4 |   10 |
| ???909 | E1.1 |    0 |
| ???909 | E1.2 |    5 |
| ???909 | E1.3 |    3 |
| ???909 | E4.1 |    0 |
| ???909 | E4.2 |    0 |
| ???909 | E4.3 |    0 |
| ???909 | E4.4 |    0 |
| ???909 | E5.1 |    0 |
| ???909 | E5.2 |    3 |
| ???909 | E5.3 |    1 |
| ???909 | E5.4 |    0 |
| ???759 | E1.1 |    0 |
| ???759 | E1.2 |   10 |
| ???759 | E1.3 |   10 |
| ???759 | E4.1 |    0 |
| ???759 | E4.2 |   10 |
| ???759 | E4.3 |   10 |
| ???759 | E4.4 |   10 |
| ???759 | E5.1 |   10 |
| ???759 | E5.2 |   10 |
| ???759 | E5.3 |   10 |
| ???759 | E5.4 |   10 |
| ???502 | E1.1 |   10 |
| ???502 | E1.2 |   10 |
| ???502 | E1.3 |   10 |
| ???502 | E4.1 |   10 |
| ???502 | E4.2 |   10 |
| ???502 | E4.3 |   10 |
| ???502 | E4.4 |   10 |
| ???502 | E5.1 |   10 |
| ???502 | E5.2 |   10 |
| ???502 | E5.3 |   10 |
| ???502 | E5.4 |   10 |
| ???652 | E1.1 |   10 |
| ???652 | E1.2 |   10 |
| ???652 | E1.3 |    9 |
| ???652 | E4.1 |   10 |
| ???652 | E4.2 |    8 |
| ???652 | E4.3 |   10 |
| ???652 | E4.4 |   10 |
| ???652 | E5.1 |    9 |
| ???652 | E5.2 |    9 |
| ???652 | E5.3 |   10 |
| ???652 | E5.4 |   10 |
| ???165 | E1.1 |    9 |
| ???165 | E1.2 |    9 |
| ???165 | E1.3 |   10 |
| ???165 | E4.1 |   10 |
| ???165 | E4.2 |    9 |
| ???165 | E4.3 |    9 |
| ???165 | E4.4 |    9 |
| ???165 | E5.1 |   10 |
| ???165 | E5.2 |    4 |
| ???165 | E5.3 |    8 |
| ???165 | E5.4 |    7 |
| ???172 | E1.1 |    5 |
| ???172 | E1.2 |    9 |
| ???172 | E1.3 |   10 |
| ???172 | E4.1 |   10 |
| ???172 | E4.2 |   10 |
| ???172 | E4.3 |   10 |
| ???172 | E4.4 |   10 |
| ???172 | E5.1 |   10 |
| ???172 | E5.2 |   10 |
| ???172 | E5.3 |    8 |
| ???172 | E5.4 |    0 |
| ???712 | E1.1 |   10 |
| ???712 | E1.2 |   10 |
| ???712 | E1.3 |   10 |
| ???712 | E4.1 |   10 |
| ???712 | E4.2 |   10 |
| ???712 | E4.3 |   10 |
| ???712 | E4.4 |   10 |
| ???712 | E5.1 |   10 |
| ???712 | E5.2 |   10 |
| ???712 | E5.3 |   10 |
| ???712 | E5.4 |   10 |
| ???726 | E1.1 |    0 |
| ???726 | E1.2 |   10 |
| ???726 | E1.3 |   10 |
| ???726 | E4.1 |    0 |
| ???726 | E4.2 |    9 |
| ???726 | E4.3 |    7 |
| ???726 | E4.4 |  9.5 |
| ???726 | E5.1 |   10 |
| ???726 | E5.2 |    3 |
| ???726 | E5.3 |    0 |
| ???726 | E5.4 |    0 |
| ???732 | E1.1 |    3 |
| ???732 | E1.2 |    5 |
| ???732 | E1.3 |    5 |
| ???732 | E4.1 |   10 |
| ???732 | E4.2 |   10 |
| ???732 | E4.3 |   10 |
| ???732 | E4.4 |   10 |
| ???732 | E5.1 |   10 |
| ???732 | E5.2 |    8 |
| ???732 | E5.3 |    0 |
| ???732 | E5.4 |    0 |
| ???638 | E1.1 |   10 |
| ???638 | E1.2 |   10 |
| ???638 | E1.3 |   10 |
| ???638 | E4.1 |   10 |
| ???638 | E4.2 |    9 |
| ???638 | E4.3 |    8 |
| ???638 | E4.4 |   10 |
| ???638 | E5.1 |   10 |
| ???638 | E5.2 |   10 |
| ???638 | E5.3 |   10 |
| ???638 | E5.4 |   10 |
| ???692 | E1.1 |   10 |
| ???692 | E1.2 |   10 |
| ???692 | E1.3 |   10 |
| ???692 | E4.1 |   10 |
| ???692 | E4.2 |   10 |
| ???692 | E4.3 |   10 |
| ???692 | E4.4 |    9 |
| ???692 | E5.1 |   10 |
| ???692 | E5.2 |   10 |
| ???692 | E5.3 |   10 |
| ???692 | E5.4 |   10 |
| ???545 | E1.1 |    2 |
| ???545 | E1.2 |    0 |
| ???545 | E1.3 |    0 |
| ???545 | E4.1 |    0 |
| ???545 | E4.2 |    8 |
| ???545 | E4.3 |    8 |
| ???545 | E4.4 |    2 |
| ???545 | E5.1 |   10 |
| ???545 | E5.2 |    3 |
| ???545 | E5.3 |    6 |
| ???545 | E5.4 |    4 |
| ???110 | E1.1 |    0 |
| ???110 | E1.2 |    0 |
| ???110 | E1.3 |    0 |
| ???110 | E4.1 |   10 |
| ???110 | E4.2 |    5 |
| ???110 | E4.3 |    5 |
| ???110 | E4.4 |    9 |
| ???110 | E5.1 |    7 |
| ???110 | E5.2 |    1 |
| ???110 | E5.3 |    0 |
| ???110 | E5.4 |    0 |

** Totais
*** Questão

#+header: :var dep0=p1_2019-2
#+header: :var dep1=peso_p1_2019-2
#+begin_src R :results table :session :exports both :colnames yes
dep1 %>%
    mutate(Q = gsub("\\..*$", "", Q)) %>%
    group_by(Q) %>%
    summarize(Maximo = sum(Peso)) -> df.maximo
p1.df.e2e3e6 %>%
    bind_rows(p1.df.e1e4e5) %>%
    ungroup %>%
    arrange(Nome, Q) %>%
    select(-Nome) %>%
    left_join(df.maximo) %>%
    mutate(ID = gsub("^...", "???", ID))
#+end_src

#+RESULTS:
| ID     | Q  |  Nota | Maximo |
|--------+----+-------+--------|
| ???253 | E1 |   0.5 |      2 |
| ???253 | E2 |     1 |      1 |
| ???253 | E3 |   0.5 |      1 |
| ???253 | E4 |   0.2 |      2 |
| ???253 | E5 |   0.1 |    2.5 |
| ???253 | E6 |   1.5 |    1.5 |
| ???162 | E1 |     0 |      2 |
| ???162 | E2 |   0.5 |      1 |
| ???162 | E3 |  0.75 |      1 |
| ???162 | E4 |  0.12 |      2 |
| ???162 | E5 |   0.2 |    2.5 |
| ???162 | E6 |     0 |    1.5 |
| ???545 | E1 |   0.1 |      2 |
| ???545 | E2 |     1 |      1 |
| ???545 | E3 |     1 |      1 |
| ???545 | E4 |  1.14 |      2 |
| ???545 | E5 |  1.18 |    2.5 |
| ???545 | E6 |  1.47 |    1.5 |
| ???759 | E1 |   1.5 |      2 |
| ???759 | E2 |  0.75 |      1 |
| ???759 | E3 |     1 |      1 |
| ???759 | E4 |   1.8 |      2 |
| ???759 | E5 |   2.5 |    2.5 |
| ???759 | E6 |   1.5 |    1.5 |
| ???887 | E1 | 1.675 |      2 |
| ???887 | E2 |  0.75 |      1 |
| ???887 | E3 | 0.875 |      1 |
| ???887 | E4 |  1.94 |      2 |
| ???887 | E5 |   2.4 |    2.5 |
| ???887 | E6 |   1.5 |    1.5 |
| ???638 | E1 |     2 |      2 |
| ???638 | E2 |  0.75 |      1 |
| ???638 | E3 |     1 |      1 |
| ???638 | E4 |  1.77 |      2 |
| ???638 | E5 |   2.5 |    2.5 |
| ???638 | E6 | 1.305 |    1.5 |
| ???726 | E1 |   1.5 |      2 |
| ???726 | E2 |     1 |      1 |
| ???726 | E3 |     1 |      1 |
| ???726 | E4 | 1.445 |      2 |
| ???726 | E5 |   0.5 |    2.5 |
| ???726 | E6 |   1.5 |    1.5 |
| ???732 | E1 |   0.9 |      2 |
| ???732 | E2 |     1 |      1 |
| ???732 | E3 |     1 |      1 |
| ???732 | E4 |     2 |      2 |
| ???732 | E5 |     1 |    2.5 |
| ???732 | E6 |  1.29 |    1.5 |
| ???712 | E1 |     2 |      2 |
| ???712 | E2 |     1 |      1 |
| ???712 | E3 | 0.875 |      1 |
| ???712 | E4 |     2 |      2 |
| ???712 | E5 |   2.5 |    2.5 |
| ???712 | E6 |   1.5 |    1.5 |
| ???451 | E1 |  0.75 |      2 |
| ???451 | E2 |     1 |      1 |
| ???451 | E3 | 0.875 |      1 |
| ???451 | E4 |     2 |      2 |
| ???451 | E5 |   2.5 |    2.5 |
| ???451 | E6 |  1.47 |    1.5 |
| ???692 | E1 |     2 |      2 |
| ???692 | E2 |     1 |      1 |
| ???692 | E3 |     1 |      1 |
| ???692 | E4 |  1.95 |      2 |
| ???692 | E5 |   2.5 |    2.5 |
| ???692 | E6 |   1.5 |    1.5 |
| ???087 | E1 |     2 |      2 |
| ???087 | E2 |     1 |      1 |
| ???087 | E3 |     1 |      1 |
| ???087 | E4 |     2 |      2 |
| ???087 | E5 |   2.5 |    2.5 |
| ???087 | E6 |     0 |    1.5 |
| ???172 | E1 | 1.675 |      2 |
| ???172 | E2 |  0.75 |      1 |
| ???172 | E3 | 0.875 |      1 |
| ???172 | E4 |     2 |      2 |
| ???172 | E5 |  1.84 |    2.5 |
| ???172 | E6 |     0 |    1.5 |
| ???652 | E1 | 1.925 |      2 |
| ???652 | E2 |   0.5 |      1 |
| ???652 | E3 |     1 |      1 |
| ???652 | E4 |  1.94 |      2 |
| ???652 | E5 |  2.38 |    2.5 |
| ???652 | E6 |   1.5 |    1.5 |
| ???909 | E1 |   0.6 |      2 |
| ???909 | E2 |   0.5 |      1 |
| ???909 | E3 | 0.875 |      1 |
| ???909 | E4 |     0 |      2 |
| ???909 | E5 |  0.38 |    2.5 |
| ???909 | E6 |   1.5 |    1.5 |
| ???991 | E1 |  1.75 |      2 |
| ???991 | E2 |     1 |      1 |
| ???991 | E3 |     1 |      1 |
| ???991 | E4 |  1.62 |      2 |
| ???991 | E5 |  1.85 |    2.5 |
| ???991 | E6 |     0 |    1.5 |
| ???108 | E1 |     2 |      2 |
| ???108 | E2 |     1 |      1 |
| ???108 | E3 |     1 |      1 |
| ???108 | E4 |  1.77 |      2 |
| ???108 | E5 |  0.38 |    2.5 |
| ???108 | E6 |     0 |    1.5 |
| ???165 | E1 | 1.875 |      2 |
| ???165 | E2 |  0.75 |      1 |
| ???165 | E3 | 0.875 |      1 |
| ???165 | E4 |  1.82 |      2 |
| ???165 | E5 |  1.59 |    2.5 |
| ???165 | E6 | 1.455 |    1.5 |
| ???502 | E1 |     2 |      2 |
| ???502 | E2 |     1 |      1 |
| ???502 | E3 |     1 |      1 |
| ???502 | E4 |     2 |      2 |
| ???502 | E5 |   2.5 |    2.5 |
| ???502 | E6 |   1.5 |    1.5 |
| ???490 | E1 |  1.95 |      2 |
| ???490 | E2 |     1 |      1 |
| ???490 | E3 |     1 |      1 |
| ???490 | E4 |  0.47 |      2 |
| ???490 | E5 |     2 |    2.5 |
| ???490 | E6 |   1.5 |    1.5 |
| ???110 | E1 |     0 |      2 |
| ???110 | E2 |  0.75 |      1 |
| ???110 | E3 |     1 |      1 |
| ???110 | E4 |   1.3 |      2 |
| ???110 | E5 |  0.24 |    2.5 |
| ???110 | E6 |     0 |    1.5 |

*** Geral

#+header: :var dep0=p1_2019-2
#+begin_src R :results table :session :exports both :colnames yes
fin.p1 %>%
    ungroup %>%
    select(-Nome) %>%
    mutate(ID = gsub("^...", "???", ID))
#+end_src

#+RESULTS:
| ID     |   P1 |
|--------+------|
| ???502 |   10 |
| ???692 | 9.95 |
| ???712 | 9.88 |
| ???638 | 9.32 |
| ???652 | 9.24 |
| ???887 | 9.14 |
| ???759 | 9.05 |
| ???451 |  8.6 |
| ???087 |  8.5 |
| ???165 | 8.37 |
| ???490 | 7.92 |
| ???991 | 7.22 |
| ???732 | 7.19 |
| ???172 | 7.14 |
| ???726 | 6.95 |
| ???108 | 6.15 |
| ???545 | 5.89 |
| ???909 | 3.86 |
| ???253 |  3.8 |
| ???110 | 3.29 |
| ???162 | 1.57 |


* Avaliação da disciplina

#+BEGIN_CENTER
[[https://goo.gl/forms/Hma6HJNo8s3WlD2o2][Avalie a disciplina/professor de maneira anônima]], preferencialmente no
final do semestre após a conclusão das aulas, mas em qualquer momento
caso o aluno pense necessário (o professor é notificado por e-mail
quando uma nova resposta é fornecida no formulário).
#+END_CENTER
